###################################################################

# Created by write_sdc on Sat Sep  6 00:02:21 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.0001 [get_ports {P[15]}]
set_load -pin_load 0.0001 [get_ports {P[14]}]
set_load -pin_load 0.0001 [get_ports {P[13]}]
set_load -pin_load 0.0001 [get_ports {P[12]}]
set_load -pin_load 0.0001 [get_ports {P[11]}]
set_load -pin_load 0.0001 [get_ports {P[10]}]
set_load -pin_load 0.0001 [get_ports {P[9]}]
set_load -pin_load 0.0001 [get_ports {P[8]}]
set_load -pin_load 0.0001 [get_ports {P[7]}]
set_load -pin_load 0.0001 [get_ports {P[6]}]
set_load -pin_load 0.0001 [get_ports {P[5]}]
set_load -pin_load 0.0001 [get_ports {P[4]}]
set_load -pin_load 0.0001 [get_ports {P[3]}]
set_load -pin_load 0.0001 [get_ports {P[2]}]
set_load -pin_load 0.0001 [get_ports {P[1]}]
set_load -pin_load 0.0001 [get_ports {P[0]}]
set_load -pin_load 0.0001 [get_ports done]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_uncertainty -setup 0.001  [get_clocks clk]
set_input_delay -clock clk  0.0001  [get_ports clk]
set_input_delay -clock clk  0.0001  [get_ports rst_n]
set_input_delay -clock clk  0.0001  [get_ports {A[7]}]
set_input_delay -clock clk  0.0001  [get_ports {A[6]}]
set_input_delay -clock clk  0.0001  [get_ports {A[5]}]
set_input_delay -clock clk  0.0001  [get_ports {A[4]}]
set_input_delay -clock clk  0.0001  [get_ports {A[3]}]
set_input_delay -clock clk  0.0001  [get_ports {A[2]}]
set_input_delay -clock clk  0.0001  [get_ports {A[1]}]
set_input_delay -clock clk  0.0001  [get_ports {A[0]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[7]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[6]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[5]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[4]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[3]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[2]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[1]}]
set_input_delay -clock clk  0.0001  [get_ports {Q[0]}]
set_output_delay -clock clk  0.0001  [get_ports {P[15]}]
set_output_delay -clock clk  0.0001  [get_ports {P[14]}]
set_output_delay -clock clk  0.0001  [get_ports {P[13]}]
set_output_delay -clock clk  0.0001  [get_ports {P[12]}]
set_output_delay -clock clk  0.0001  [get_ports {P[11]}]
set_output_delay -clock clk  0.0001  [get_ports {P[10]}]
set_output_delay -clock clk  0.0001  [get_ports {P[9]}]
set_output_delay -clock clk  0.0001  [get_ports {P[8]}]
set_output_delay -clock clk  0.0001  [get_ports {P[7]}]
set_output_delay -clock clk  0.0001  [get_ports {P[6]}]
set_output_delay -clock clk  0.0001  [get_ports {P[5]}]
set_output_delay -clock clk  0.0001  [get_ports {P[4]}]
set_output_delay -clock clk  0.0001  [get_ports {P[3]}]
set_output_delay -clock clk  0.0001  [get_ports {P[2]}]
set_output_delay -clock clk  0.0001  [get_ports {P[1]}]
set_output_delay -clock clk  0.0001  [get_ports {P[0]}]
set_output_delay -clock clk  0.0001  [get_ports done]
set_drive 0.0001  [get_ports clk]
set_drive 0.0001  [get_ports rst_n]
set_drive 0.0001  [get_ports {A[7]}]
set_drive 0.0001  [get_ports {A[6]}]
set_drive 0.0001  [get_ports {A[5]}]
set_drive 0.0001  [get_ports {A[4]}]
set_drive 0.0001  [get_ports {A[3]}]
set_drive 0.0001  [get_ports {A[2]}]
set_drive 0.0001  [get_ports {A[1]}]
set_drive 0.0001  [get_ports {A[0]}]
set_drive 0.0001  [get_ports {Q[7]}]
set_drive 0.0001  [get_ports {Q[6]}]
set_drive 0.0001  [get_ports {Q[5]}]
set_drive 0.0001  [get_ports {Q[4]}]
set_drive 0.0001  [get_ports {Q[3]}]
set_drive 0.0001  [get_ports {Q[2]}]
set_drive 0.0001  [get_ports {Q[1]}]
set_drive 0.0001  [get_ports {Q[0]}]
